# Task 6

1. Import the NumPy library and create a 2D array data from the given data in the table above.

In [1]:
import pandas as pd 
import numpy as np

import warnings
warnings.filterwarnings("ignore")

In [2]:
df=pd.read_csv('D:\data science/padas_question.csv')
df

      Name  Gender  Age  Height (cm)  Weight (kg)         City
0    Alice  Female   25          165           58     New York
1      Bob    Male   30          180           80  Los Angeles
2  Charlie    Male   35          175           70      Chicago
3    Diana  Female   28          170           65        Miami
4      Eva  Female   27          175           60     New York
5    Frank    Male   40          190           85      Houston
6    Grace  Female   32          168           55      Chicago
7    Henry    Male   45          175           75  Los Angeles
8      Ivy  Female   26          172           63        Miami
9     Jack    Male   28          180           78     New York

In [3]:
data_list=df.values.tolist()
data_list

[['Alice', 'Female', 25, 165, 58, 'New York'],
 ['Bob', 'Male', 30, 180, 80, 'Los Angeles'],
 ['Charlie', 'Male', 35, 175, 70, 'Chicago'],
 ['Diana', 'Female', 28, 170, 65, 'Miami'],
 ['Eva', 'Female', 27, 175, 60, 'New York'],
 ['Frank', 'Male', 40, 190, 85, 'Houston'],
 ['Grace', 'Female', 32, 168, 55, 'Chicago'],
 ['Henry', 'Male', 45, 175, 75, 'Los Angeles'],
 ['Ivy', 'Female', 26, 172, 63, 'Miami'],
 ['Jack', 'Male', 28, 180, 78, 'New York']]

In [4]:
data_list=np.array(df)
data_list

array([['Alice', 'Female', 25, 165, 58, 'New York'],
       ['Bob', 'Male', 30, 180, 80, 'Los Angeles'],
       ['Charlie', 'Male', 35, 175, 70, 'Chicago'],
       ['Diana', 'Female', 28, 170, 65, 'Miami'],
       ['Eva', 'Female', 27, 175, 60, 'New York'],
       ['Frank', 'Male', 40, 190, 85, 'Houston'],
       ['Grace', 'Female', 32, 168, 55, 'Chicago'],
       ['Henry', 'Male', 45, 175, 75, 'Los Angeles'],
       ['Ivy', 'Female', 26, 172, 63, 'Miami'],
       ['Jack', 'Male', 28, 180, 78, 'New York']], dtype=object)

2. Print the shape of the data array

In [5]:
df.shape

(10, 6)

3. Extract the column of heights from the data array and assign it to a new variable heights.

In [6]:
heights=data_list[:,3] # take all rows and the fourth column (index 3)
heights

array([165, 180, 175, 170, 175, 190, 168, 175, 172, 180], dtype=object)

4. Calculate the mean height of the group using NumPy.

In [7]:
np.mean(heights)

175.0

5. Extract the rows of females from the data array and assign it to a new variable females.

In [8]:
females=data_list[data_list[:,1]=='Female']
females

array([['Alice', 'Female', 25, 165, 58, 'New York'],
       ['Diana', 'Female', 28, 170, 65, 'Miami'],
       ['Eva', 'Female', 27, 175, 60, 'New York'],
       ['Grace', 'Female', 32, 168, 55, 'Chicago'],
       ['Ivy', 'Female', 26, 172, 63, 'Miami']], dtype=object)

6. Calculate the mean weight of the females in the group using NumPy.

In [9]:
weight=females[:,4] 
weight

array([58, 65, 60, 55, 63], dtype=object)

In [10]:
np.mean(weight)

60.2